#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/kubernetes-ops-dev-helm-kube-prometheus-stack/runs/run-jVwWhKVk4AeMGwnC

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.kube-prometheus-stack.helm_release.helm_chart: Refreshing state... [id=kube-prometheus-stack]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.certificate will be created
  + resource "kubectl_manifest" "certificate" {
      + api_version             = "cert-manager.io/v1"
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Certificate"
      + live_manifest_incluster = (sensitive value)
      + live_resource_version   = (known after apply)
      + live_uid                = (known after apply)
      + name                    = "domain-wildcard"
      + namespace               = "monitoring"
      + resource_version        = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: Certificate
            metadata:
              name: domain-wildcard
              namespace: monitoring
            spec:
              commonName: '*.dev.k8s.managedkube.com'
              dnsNames:
              - '*.dev.k8s.managedkube.com'
              issuerRef:
                group: cert-manager.io
                kind: ClusterIssuer
                name: letsencrypt-prod-dns01
              secretName: domain-wildcard
        EOT
      + yaml_incluster          = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```


</details>

*Pusher: @sekka1, Action: `pull_request`*